const projectData = {
    work: [
        {
            title: '演出全品类票档页',
            label: '设计技术方案，将多种选票方式模版化，<br/> 选票区域模块化，<br/> 解耦选票逻辑，灵活的架构，为后续的多种玩法打下基础，/br开发多种选票组件并组成多种选票模版，日历型，Tab型等，完成五种不同模版，N种组件的开发；业务和性能指标埋点，上线后通过监测数据，持续迭代和优化页面',
            skills: ['Vue', '小程序'],
            img: 'https://s2.ax1x.com/2020/02/04/1DA2vT.jpg',
        }
    ],
    personal: [
        {
            title: '演出全品类票档页',
            label: '设计技术方案，将多种选票方式模版化，<br/> 选票区域模块化，<br/> 解耦选票逻辑，灵活的架构，为后续的多种玩法打下基础，/br开发多种选票组件并组成多种选票模版，日历型，Tab型等，完成五种不同模版，N种组件的开发；业务和性能指标埋点，上线后通过监测数据，持续迭代和优化页面',
            skills: ['Vue', '小程序'],
            img: 'https://s2.ax1x.com/2020/02/04/1DA2vT.jpg',
        }
    ]
}

export default projectData