const projectData = {
    work: [
        {
            title: '猫眼演出全品类票档页',
            label: '购票流程选票改造，不针对不同品类演出又不同的票务结构，根据不同演出品类，场次时间跨度提供多模版，提升用户在不同品类项目的购票体验<br/>对页面进行结构划分和模块划分的设计，模块高内聚低耦合，承担自己单独的任务，更好的去做模块灵活性的变化和页面的通用逻辑的抽取。<br/>开发多种UI组件，Tab，日历，卡片等，由不同组件灵活的去组合成针对不同场景的五种模版。<br/>进行业务和性能埋点，观测数据持续对页面进行针对性的优化。',
            skills: ['Vue', '小程序', 'H5', '点评', '美团', '猫眼', '微信'],
            img: 'https://s2.ax1x.com/2020/02/08/1R2n0S.jpg',
            avator:'https://s2.ax1x.com/2020/02/08/1W9678.jpg',
        },
        {
            title: '售票实时流量监控',
            label: '一个实时数据推送，数据实时动态渲染的数据可视化看板<br/>前期进行技术选型的调研和项目搭建，选用Dva+Umi+G2的技术栈来开发这个项目，搭建自动化构建的测试环境和生产环境<br/>实现数据的实时更新和render，增量更新解决大数据量级下的实时重绘<br/>上线后用于监控十场林俊杰，N场周杰伦，陈情令，RISE，VAC等超大流量项目，上线后用于监控十场林俊杰，N场周杰伦，陈情令，RISE，VAC等超大流量项目，稳定的性能和清晰数据可视化帮助运营和产品及时调整策略提高售卖转化率',
            skills: ['Dva', 'Umi', 'React', 'G2', '数据可视化', '实时更新'],
            img: 'https://s2.ax1x.com/2020/02/08/1RHT0A.png',
            avator:'https://s2.ax1x.com/2020/02/08/1RHT0A.png',
        },
        {
            title: 'LOL/售卖权限验证',
            label: 'LOL，王者荣耀等电竞类项目需进行售票权限校验，比如拥有游戏账户或账号到达一定等级等，于是需要跳转至第三方进行校验再回到演出页面。<br/>设计方案并开发三方权限验证页，通用的功能和兼容性，仅开发了一个页面，就支持美团猫眼点评APP以及小程序，微信公众号用户的校验后跳转回演出项目进行购买。<br/>接入美团风控滑块Yoda。<br/>支持了LOL音乐会，王者荣耀秋季决赛，王者荣耀音乐会等项目的权限验证，帮助真正的用户能够买到票。',
            skills: ['Vue', 'H5', 'Yoda'],
            img: 'https://s2.ax1x.com/2020/02/08/1RjFQf.jpg',
            avator: 'https://s2.ax1x.com/2020/02/08/1Rx3a4.jpg',
        }
    ],
    personal: [
        {
            title: '演出全品类票档页',
            label: '设计技术方案，将多种选票方式模版化，<br/> 选票区域模块化，<br/> 解耦选票逻辑，灵活的架构，为后续的多种玩法打下基础，/br开发多种选票组件并组成多种选票模版，日历型，Tab型等，完成五种不同模版，N种组件的开发；业务和性能指标埋点，上线后通过监测数据，持续迭代和优化页面',
            skills: ['Vue', '小程序'],
            img: 'https://s2.ax1x.com/2020/02/04/1DA2vT.jpg',
            avator:'https://s2.ax1x.com/2020/02/08/1RdODs.jpg',
        }
    ]
}

export default projectData